[
  {
    "title": "BXon",
    "position": "Backend-разработчик",
    "location": "Москва",
    "website": "",
    "isRemote": true,
    "description": "Разработка CRM-системы для ведения проектов, общения с заказчиками, постановки сроков и задач на базе этой CRM-системы. Исполнение обязанностей тимлида.",
    "dateStart": {
      "year": 2012,
      "month": 2
    },
    "dateEnd": {
      "year": 2016,
      "month": 3
    }
  },
  {
    "title": "Wooppay",
    "position": "Backend-разработчик",
    "location": "Караганда",
    "website": "https://www.wooppay.com",
    "isRemote": false,
    "description": "Был ответственный за backend-часть мобильного приложения. Поддержка и развитие контрактов взаимодействия с мобильным приложением. Разработка микросервиса, контрактов и документации для интеграции партнеров (B2B).",
    "dateStart": {
      "year": 2016,
      "month": 4
    },
    "dateEnd": {
      "year": 2018,
      "month": 12
    }
  },
  {
    "title": "Yuwert IT",
    "position": "Тимлид",
    "location": "Караганда",
    "website": "",
    "isRemote": false,
    "description": "Руководство отделом бэкенд-разработки. Наем сотрудников, проведение технических собеседований, сопровождение адаптации сотрудников. Выбор стэка технологий, прототипирование БД, разработка архитектуры проектов, разработка контрактов взаимодействия микросервисов. Разработка и внедрение технической документаций по проектам. Внедрение механизма тестирования, в том числе автотестов (юнит, функциональные, модульные). Повышение общего технического уровня команды.",
    "dateStart": {
      "year": 2018,
      "month": 12
    },
    "dateEnd": {
      "year": 2020,
      "month": 10
    }
  },
  {
    "title": "ЦИТ \"Орлеу\"",
    "position": "Backend-разработчик",
    "location": "Караганда",
    "website": "https://bilimal.kz",
    "isRemote": false,
    "description": "Разработка микросервисов для нужд компании, проектировка архитектуры для высоко-нагруженных проектов, разработка архитектуры БД, сопровождение проектов после окончания стадии разработки и проведение пусконаладочных работ",
    "dateStart": {
      "year": 2020,
      "month": 10
    },
    "dateEnd": {
      "year": 2022,
      "month": 9
    }
  },
  {
    "title": "Сервис такси Carinway",
    "position": "Тимлид",
    "location": "Караганда",
    "website": "",
    "isRemote": true,
    "description": "Проектирование архитектуры проектов. Выбор стэка технологий. Руководство командой разработки. Разработка и внедрение технической документации. Внедрение механизма тестирования, в том числе автотестов.",
    "dateStart": {
      "year": 2022,
      "month": 9
    },
    "dateEnd": {
      "year": 2024,
      "month": 10
    }
  }
]
